## Exercises I

In [ ]:
# Run python -m pip install pymysql from your terminal to install pymysql.

# Create a notebook or python script named advanced_dataframes to do your work in for these exercises.

# Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)
# cd into your exercises folder for this module and run echo env.py >> .gitignore
# Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [ ]:
# Use your function to obtain a connection to the employees database.

In [3]:
import numpy as np
import pandas as pd

from env import host, username, password

get_db_url = f'mysql+pymysql://{user}:{password}@{host}/employees'

get_db_url

SyntaxError: invalid syntax (env.py, line 7)

In [19]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', get_db_url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [ ]:
# Once you have successfully run a query:

In [21]:
sql = '''
SELECT
    emp_no,
    first_name,
    last_name
FROM employees
WHERE gender = 'F'
LIMIT 100
'''

employees = pd.read_sql(sql, get_db_url)
employees.head()

   emp_no first_name  last_name
0   10002    Bezalel     Simmel
1   10006     Anneke    Preusig
2   10007    Tzvetan  Zielinski
3   10009     Sumant       Peac
4   10010  Duangkaew   Piveteau

In [ ]:
# a. Intentionally make a typo in the database url. What kind of error message do you see?
# NoSuchModuleError: Can't load plugin: sqlalchemy.dialects:msql.pymysql

# b. Intentionally make an error in your SQL query. What does the error message look like?
# 1054, "Unknown column 'mp_no' in 'field list'"

In [ ]:
# 6. Read the employees and titles tables into two separate DataFrames.

In [60]:
employees = pd.read_sql('select * from employees', get_db_url)
employees.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [69]:
titles = pd.read_sql('SELECT * FROM titles', get_db_url)
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [ ]:
# 7. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [48]:
employees.shape

(300024, 6)

In [49]:
titles.shape

(443308, 4)

In [ ]:
# 8. Display the summary statistics for each DataFrame.

In [51]:
employees.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [52]:
titles.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [ ]:
# 9. How many unique titles are in the titles DataFrame?

In [58]:
titles.nunique()

emp_no       300024
title             7
from_date      6393
to_date        5888
dtype: int64

In [59]:
titles.title.value_counts()

Engineer              115003
Staff                 107391
Senior Engineer        97750
Senior Staff           92853
Technique Leader       15159
Assistant Engineer     15128
Manager                   24
Name: title, dtype: int64

In [ ]:
# 10. What is the oldest date in the to_date column?

In [63]:
titles.sort_values(by = 'to_date', ascending=True).head(1)

       emp_no     title   from_date     to_date
16064   20869  Engineer  1985-02-17  1985-03-01

In [ ]:
# 11. What is the most recent date in the to_date column?

In [79]:
most_recent = pd.read_sql('SELECT * FROM titles where to_date < now()', get_db_url)

In [81]:
most_recent.sort_values(by = 'to_date', ascending = False).head(1)

       emp_no             title   from_date     to_date
70899  204324  Technique Leader  1985-02-10  2002-08-01